In [2]:
import pandas as pd
import numpy as  np

In [3]:
stocks = ['PLW', 'CDR', '11B', 'TEN']

### 1 -  Create a Series object.

In [4]:
 ser = pd.Series(stocks)

In [5]:
ser

0    PLW
1    CDR
2    11B
3    TEN
dtype: object

### 2 - Create a Series object and assign in to the quotations variable.

In [6]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}

In [7]:
ser_two = pd.Series(stocks)

In [8]:
ser_two

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

### 3 - Convert quotations to a list

In [46]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(stocks)

In [47]:
quotations_list = quotations.tolist()

In [48]:
quotations_list

[387.0, 339.5, 349.5, 391.0]

### 4 - Convert the quotations object below to the DataFrame object

In [49]:
df = pd.DataFrame(quotations, columns=['price'])

In [50]:
df

     price
PLW  387.0
CDR  339.5
TEN  349.5
11B  391.0

### 5 - Using the numpy and pandas build the following

In [51]:
numbers = pd.Series(np.arange(10,100,10),index= np.arange(101,110,1),dtype='float')

In [52]:
numbers

101    10.0
102    20.0
103    30.0
104    40.0
105    50.0
106    60.0
107    70.0
108    80.0
109    90.0
dtype: float64

### 6 - Convert its type to int

In [53]:
series = pd.Series(['001', '002', '003', '004'], list('abcd'))

In [54]:
series = pd.to_numeric(series)

In [55]:
series

a    1
b    2
c    3
d    4
dtype: int64

### 7 - Add two elements 
#### key: BBT, value: 25.5
#### F51, value: 19.2

In [61]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0}
quotations = pd.Series(stocks)
quotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
dtype: float64

In [63]:
quotations = quotations.append(pd.Series({'BBT': 387.00 ,'F51': 19.2}))
quotations

PLW    387.0
CDR    339.5
TEN    349.5
11B    391.0
BBT    387.0
F51     19.2
dtype: float64

### Convert the quotations to DataFrame
##### Reset the index and name the columns 'ticker' and 'price'.

In [83]:
stocks = {'PLW': 387.00, 'CDR': 339.5, 'TEN': 349.5, '11B': 391.0, 'BBT': 25.5, 'F51': 19.2}
quotations = pd.Series(data=stocks)
quotations = pd.DataFrame(quotations).reset_index()
quotations.columns = ['ticker' , 'price']
quotations

  ticker  price
0    PLW  387.0
1    CDR  339.5
2    TEN  349.5
3    11B  391.0
4    BBT   25.5
5    F51   19.2

### Build the DataFrame obj below and assign it to the companies variable 
#### company	price	ticker
##### 0	Amazon	2375.0	AMZN.US
##### 1	Microsoft	178.6	MSFT.US
##### 2	Facebook	179.2	FB.US

In [106]:
dict = {'company': ["Amazon","Microsoft","Facebook"], 
        'price': [2375,178.6,179.2], 
        'ticker': ["AMZN.US","MSFT.US","FB.US"]}

In [108]:
df = pd.DataFrame(dict)
df

     company   price   ticker
0     Amazon  2375.0  AMZN.US
1  Microsoft   178.6  MSFT.US
2   Facebook   179.2    FB.US

### Convert the first column of the companies obj to index

In [116]:
df = df.set_index('company')
df

          price   ticker  index
company
0        2375.0  AMZN.US      0
1         178.6  MSFT.US      1
2         179.2    FB.US      2